Repository: Compolomus/mobicms-classic
Catalog: modules/downloads/locale/*/default.po
Languages: ro

source: Rating
ro: Voturi

source: Comments
ro: Comentarii

source: Uploaded
ro: Incarcat

source: Downloads
ro: Descarcari

source: Favorites
ro: Favorite

source: For registered users only
ro: Doar pentru utilizatori inregistrati

source: The list is empty
ro: Lista este goala

source: To Page
ro: La pagina

source: Comments are disabled
ro: Comentariile sunt dezactivate

source: File not found
ro: Fisierul nu a fost gasit

source: Back
ro: Înapoi

source: Review comments
ro: Comentariile de revizuire

source: Delete File
ro: Sterge fisier

source: Delete
ro: Șterge

source: Description
ro: Descriere

source: Maximum 500 characters
ro: Maxim 500 de caractere

source: Save
ro: Salveaza

source: The required fields are not filled
ro: Campurile necesare nu au fost completate

source: Repeat
ro: Repeta

source: Name for display
ro: Numele de afișat

source: Link to download file
ro: Adresa de descarcare

source: Screenshot is attached
ro: Captura de ecran este atașata

source: Screenshot not attached
ro: Captura de ecran nu este atașata

source: Upload more
ro: Incarca mai multe

source: Screenshot
ro: Captura de ecran

source: Upload
ro: Incarca

source: File weight should not exceed
ro: Dimensiunea fisierului trebuie respectata

source: A screenshot is automatically converted to a picture, of a width not exceeding 240px (height will be calculated automatically)
ro: O captura de ecran este convertita automat in poza, cu marimea de maxim 240px (inaltimea va fi calculate automat)

source: Edit File
ro: Editeaza fisier

source: Do you really want to delete?
ro: Esti sigur ca vrei sa stergi?

source: Cancel
ro: Anuleaza

source: Invalid Link
ro: Adresa invalida

source: The weight of the file exceeds
ro: Dimensiunea fisierului este depasita

source: Prohibited file type!<br>To upload allowed files that have the following extensions
ro: Tip de fișier interzis!<br>Incarca fisiere care sunt permise cu urmatoarele extensii

source: The file name length must not exceed 100 characters
ro: Numele fisierului nu trebuie sa depaseasca 100 de caractere

source: The file name contains invalid characters
ro: Numele fisierului contine caractere invalide

source: File attached
ro: Fisier atasat

source: File not attached
ro: Fisierul nu este atasat

source: Additional Files
ro: Fisiere aditionale

source: Select File
ro: Selecteaza fisier

source: Or link to it
ro: Sau o adresa catre el

source: Save as (max. 30, without extension)
ro: Salveaza ca (max. 30, fara extensie)

source: Download the additional file
ro: Descarca fisierul aditional

source: Allowed extensions
ro: Extensii permise

source: Edit
ro: Editeaza

source: Edit MP3 Tags
ro: Editeaza Tag MP3

source: Tags saved
ro: Tag salvat

source: Title
ro: Titlu

source: Genre
ro: Genul

source: Year
ro: Anul

source: Move File
ro: Muta fisier

source: The file has been moved
ro: Fisierul a fost mutat

source: Update counters
ro: Actualizeaza contor

source: Move to this folder
ro: Muta la acest folder

source: The directory does not exist
ro: Directorul nu exista

source: File import
ro: Importa fisier

source: Continue
ro: Continua

source: Link to file
ro: Adresa catre fisier

source: File Name
ro: Numele fisierului

source: Files on moderation
ro: Fisiere cu moderare

source: File accepted
ro: Fisier acceptat

source: All files accepted
ro: Toate fisierele sunt acceptate

source: Accept
ro: Accepta

source: Accept all files
ro: Accepta toate fisierele

source: New Files
ro: Fisiere noi

source: Most Commented
ro: Cele mai comentate

source: Most Downloaded
ro: Cele mai descarcate

source: Popular Files
ro: Fisiere populare

source: Upload File
ro: Incarca fisier

source: If you pass moderation, it will be added to the Downloads
ro: Daca treci de moderare, va fi adaugat in Descarcari

source: Download
ro: Descarcă

source: Access forbidden
ro: Acess interzis

source: User Files
ro: Fisier Utilizator

source: User does not exists
ro: Utilizatorul nu exista

source: Profile
ro: Profil

source: Invalid characters
ro: Caractere invalide

source: You can write only the following extensions
ro: Puteți scrie doar următoarele extensii

source: Create Folder
ro: Creeaza folder

source: The Folder is created
ro: Folderul este creat

source: Error creating categories
ro: Eroare la crearea categoriilor

source: Folder Name
ro: Numele dosarului

source: Title to display
ro: Titlu de afisat

source: Allow users to upload files
ro: Permite utilizatorilor sa incarce fisiere

source: Create
ro: Creeaza

source: Before removing, delete subdirectories
ro: Inainte de eliminare, sterge subfoldere

source: Delete Folder
ro: Sterge folder

source: Change Folder
ro: Modifica folder

source: Remove missing files
ro: Inlatura fisiere lipsa

source: Database successfully updated
ro: Baza de date actualizata cu sucess

source: Update Files
ro: Actualizeaza fisiere

source: Added
ro: Adaugat

source: Categories
ro: Categorii

source: Files
ro: Fisiere

source: Update
ro: Actualizeaza

source: Current folder
ro: Folder curent

source: Current folder and all subfolders
ro: Folder current si toate subfolderele

source: Entire Downloads
ro: Toate descarcarile

source: Search
ro: Cauta

source: Search in description
ro: Cauta in descriere

source: Invalid file name length. Allowed a minimum of 3 and a maximum of 64 characters.
ro: Lungimea numelui fisierului invalida. Sunt permise minim 3 si maxim 64 de caractere.

source: Search results
ro: Rezultatele cautarii

source: No items found
ro: Nici in obiect gasit

source: New Search
ro: Cautare noua

source: Search by file Name and is case insensitive.<br>The length of the request: 2mins. 64макс.
ro: Cauta dupa numele fisierului. <br> Lungime necesara: min. 2, max. 64 de caractere

source: Top Users
ro: Top utilizatori

source: The file is on moderation
ro: Fisierul este sub moderare

source: Channels
ro: Canale

source: Sample rate
ro: Evaluare de probă

source: Bitrate
ro: Numarul de biti (bitrate)

source: Duration
ro: Durata

source: Resolution
ro: Rezolutie

source: File name
ro: Numele fisierului

source: Uploaded by
ro: Incarcat de

source: Voice adopted
ro: Voce adaptata

source: Files for Download
ro: Fisiere pentru descarcare

source: Add to Favorites
ro: Adauga la favorite

source: Remove from Favorites
ro: Sterge de la favorite

source: Edit Description
ro: Editeaza descriere

source: Managing Screenshots
ro: Administreaza captura de ecran

source: Downloads are closed
ro: Descarcarile sunt inchise

source: Top Files
ro: Top fisiere

source: List of category
ro: Lista categoriilor

source: Up
ro: Sus

source: Down
ro: Jos

source: List of Files
ro: Lista fisierelor

source: Sorting
ro: Sortare

source: by time
ro: dupa timp

source: by name
ro: dupa nume

source: descending
ro: descrescator

source: ascending
ro: crescator

source: Folders
ro: Dosare

source: Import File
ro: Importa fisier
