Repository: Compolomus/mobicms-classic
Catalog: mail/locale/*/default.po
Languages: ro

source: Mail
ro: Mesagerie

source: Deleting messages
ro: Ștergere mesaje

source: Message does not exist
ro: Mesajul nu exista

source: Message deleted
ro: Mesajul a fost sters

source: Back
ro: Înapoi

source: You really want to remove the message?
ro: Într-adevăr doriți să eliminați mesajul?

source: Delete
ro: Șterge

source: The message for removal isn't chosen
ro: Mesajul pentru eliminare nu este ales

source: Contact deleted
ro: Contact sters

source: Continue
ro: Continua

source: When you delete a contact is deleted and all correspondence with him.<br>Are you sure you want to delete?
ro: Cand stergi un prieten, se sterg si toate mesajele primite si trimise de la acesta. <br> Esti sigur ca vrei sa stergi?

source: Contact for removal isn't chosen
ro: Contactul de sters nu este selectat

source: Files
ro: Fisiere

source: The list is empty
ro: Lista este goala

source: To Page
ro: La pagina

source: Blocklist
ro: Blocati

source: User does not exists
ro: Utilizatorul nu exista

source: User not blocked
ro: Utilizatorul nu este blocat

source: User is unblocked
ro: Utilizatorul este deblocat

source: You really want to unblock contact?
ro: Esti sigur ca vrei sa deblochezi utilizatorul?

source: Unblock
ro: Deblocheaza

source: Contact isn't chosen
ro: Contactul nu este ales

source: This user can not be blocked
ro: Acest utilizator nu poate fi blocat

source: User is blocked
ro: Utilizatorul este blocat

source: You really want to block contact?
ro: Esti sigur ca vrei sa stergi contactul?

source: Block
ro: Blocheaza

source: My Contacts
ro: Contactele mele

source: Correspondence
ro: Corespondenta

source: Incoming messages
ro: Mesaje primite

source: Such file does not exist
ro: Fisierul nu exista

source: No file selected
ro: Nici in fisier selectat

source: New Messages
ro: Mesaje noi

source: Block Sender
ro: Blocheaza

source: Sent messages
ro: Mesaje trimise

source: Messages are deleted
ro: Mesajele sunt sterse

source: Confirm the deletion of messages
ro: Confirma stergerea mesajelor

source: System messages
ro: Mesaje automate

source: Clear messages
ro: Sterge mesaje

source: Specify the recipient's login
ro: Specifica numele carui vrei sa ii trimiti

source: Message cannot be empty
ro: Mesajul nu poate fi gol

source: You cannot send messages to yourself
ro: Nu iti poti trimite mesaje singur

source: You cannot add the message so often. Please, wait %d sec.
ro: Nu poti trimite mesaje asa des. Te rog, asteapta %d sec.

source: To this user can write only contacts
ro: Acestui utilizator ii pot scrie doar contactele

source: To this user can write only friends
ro: Acestui utilizator ii pot scrie doar prietenii

source: Error uploading file
ro: Eroare la incarcarea fisierului

source: It is forbidden to upload files without a name
ro: Este interzisa incarcarea fisierelor fara nume

source: It is forbidden to upload files without extension
ro: Este interzisa incarcarea fisierelor fara extensie

source: The size of the file exceeds the maximum allowable upload
ro: Fisierul este prea mare

source: File name contains invalid characters
ro: Numele fisierului contine caractere invalide

source: Forbidden file type! By uploading permitted only files with the following extension
ro: Tipul fisierului este interzis! Sunt premise doar fisiere cu extensiile

source: The user at your ignore list. Sending the message is impossible.
ro: Utilizatorul este blocat. Trimiterea mesajelor catre acesta este imposibila.

source: The user added you in the ignore list. Sending the message isn't possible.
ro: Utilizatorul te-a adăugat în lista de ignorare. Trimiterea mesajului nu este posibila.

source: Message already exists
ro: Mesajul exista deja

source: To Whom
ro: Catre cine

source: Send
ro: Trimite

source: Personal correspondence with
ro: Corespondenta personala cu

source: Send a message
ro: Trimite in mesaj

source: File
ro: Fisier

source: Contacts
ro: Contacte

source: You cannot add yourself as a contact
ro: Nu te poti adauga singur la contacte

source: User has been added to your contact list
ro: Utilizatorul a fost adaugat la contacte

source: You really want to add contact?
ro: Esti sigur ca vrei sa adaugi contact?

source: Add
ro: Adauga

source: Block User
ro: Blocheaza utilizator
